using InteriorHubServer.Domain.Entities;

namespace InteriorHubServer.Persistence.TestData
{
    public partial class TestData
    {
        private static Project GetProject11(Agency agency, List<Image> images, int count)
        {
            var project = new Project
            {
                Name = "Мінімалістична естетика",
                MainImage = images[67 + count / 5],
                Agency = agency
            };
            project.Elements.Add(new ProjectElement
            {
                Type = "text",
                Text = "Основною ідеєю проекту було збереження вихідного простору головного приміщення з трьома великими" +
                " вікнами у підлогу та виходом у патіо. Для природного освітлення спалень та невеликої антресолі з додатковим" +
                " спальним місцем використовується прийом із вторинним освітленням крізь скляні перегородки. Кабінет" +
                " відокремлений від вітальні книжковою шафою, задня стінка якої використовується як виставковий стенд.\r\n\r\n" +
                "За допомогою цих рішень вдалося розмістити сім освітлених функціональних зон (3 спальні, вітальня, кухня, кабінет," +
                " спальне місце на антресолі) за наявності лише трьох вікон.\r\n\r\nСтіни спалень додатково звукоізольовані, в " +
                "перегородках використано подвійне скління з порогами під дверима, міжкімнатні двері - підвищеної товщини (60мм). " +
                "Крім того, для забезпечення правильного мікроклімату у приміщеннях у всій квартирі встановлено систему примусової " +
                "вентиляції із зволоженням.\r\n\r\nІнтер'єр виконаний у мінімалістській естетиці: нейтральне тло (білі стіни, " +
                "дерев'яна підлога теплого відтінку) з акцентами на предмети мистецтва з колекції замовників та меблі.",
                OrderNumber = 1,
            });
            for (int i = 0; i < 9; i++)
            {
                project.Elements.Add(new ProjectElement
                {
                    Type = "image",
                    ProjectImage = new ProjectImage
                    {
                        Image = images[67 + i],
                        Project = project
                    },
                    OrderNumber = 2 + i,
                });
            }

            return project;
        }

        private static Project GetProject12(Agency agency, List<Image> images, int count)
        {
            var project = new Project
            {
                Name = "Класичний дизайн",
                MainImage = images[76 + count / 5],
                Agency = agency
            };
            project.Elements.Add(new ProjectElement
            {
                Type = "text",
                Text = "Інтер'єр побудований на змішуванні мінімалістської естетики з класичними елементами: на підлозі" +
                " використаний паркет «англійська ялинка», у санвузлах та передпокої застосований натуральний камінь, у" +
                " кімнатах на стінах встановлені переосмислені класичні панелі лаконічної форми, які під вікнами переходять " +
                "у витончені ґрати для маскування радіаторів. периметру стелі у вітальні зроблений переосмислений карниз," +
                " який на кутах не замикається, а перетворюється на відкриті «тюльпани»; кілька робіт сучасних художників" +
                " оформлені в класичні позолочені рами.\r\n",
                OrderNumber = 1,
            });
            for (int i = 0; i < 13; i++)
            {
                project.Elements.Add(new ProjectElement
                {
                    Type = "image",
                    ProjectImage = new ProjectImage
                    {
                        Image = images[76 + i],
                        Project = project
                    },
                    OrderNumber = 2 + i,
                });
            }

            return project;
        }

        private static Project GetProject13(Agency agency, List<Image> images, int count)
        {
            var project = new Project
            {
                Name = "Кімната для підлітка",
                MainImage = images[89 + count / 10],
                Agency = agency
            };
            project.Elements.Add(new ProjectElement
            {
                Type = "text",
                Text = "МІСЦЕ: Київ, Україна\r\nПЛОЩА:  14м2\r\n\r\nСпочатку в кімнаті знаходилося багато різних предметів," +
                " що окремо стоять: шафа для одягу і постільної білизни всієї родини, стелаж для підручників, комод для дрібниць" +
                " і книг, односпальне ліжко і робочий стіл. Через цей простір сприймалося дрібно, що характерно для багатьох" +
                " квартир. Ми запропонували скомпонувати окремі предмети в одній частині кімнати, тим самим звільнивши від них" +
                " іншу. Для цього ми запроектували багатофункціональний \"бокс\", який вміщує компактну систему зберігання (гардероб," +
                " комод, книжковий стелаж, шафку для зберігання дрібниць, ящики для постільної білизни і великих предметів) і місце" +
                " для сну і відпочинку (ліжко і диван).\r\n\r\nНа протилежній від \"боксу\" стіні ми розмістили багатофункціональну" +
                " поверхню, яка є дзеркалом, органайзером та екраном. Це вдалося отримати за допомогою зсувної панелі, яка в одному" +
                " положенні відкриває органайзер, в іншому дзеркало, а в центральному є екраном для проектора.",
                OrderNumber = 1,
            });
            for (int i = 0; i < 3; i++)
            {
                project.Elements.Add(new ProjectElement
                {
                    Type = "image",
                    ProjectImage = new ProjectImage
                    {
                        Image = images[89 + i],
                        Project = project
                    },
                    OrderNumber = 2 + i,
                });
            }

            return project;
        }

        private static Project GetProject14(Agency agency, List<Image> images, int count)
        {
            var project = new Project
            {
                Name = "ІНТЕР'ЄР MUA",
                MainImage = images[92 + count / 5],
                Agency = agency
            };
            project.Elements.Add(new ProjectElement
            {
                Type = "text",
                Text = "На реалізацію проекту було виділено відносно невеликий бюджет, тому щоб отримати візуально нестандартне" +
                " рішення, було вирішено багато робити своїми руками на місці, починаючи від оздоблення будинку, закінчуючи меблями" +
                " та декором. Тим більше, господиня будинку була готова активно включитися в процес.\r\n\r\nМайже всі меблі та" +
                " елементи у квартирі виготовлені на місці із соснових меблевих щитів та дощок за нашими ескізами. Всього з меблевого" +
                " щита виготовлено понад десяток предметів меблів: сходи, шафа, ліжко, обідній та робочі столи, стільниця та фартух " +
                "на кухню та пральню, тумба під раковину, декоративне обрамлення вікон.\r\n\r\nОздоблення стіни кухні на першому " +
                "поверсі виконане з хвойної дошки різної ширини. Дошки зістарили за допомогою підручних інструментів: сокири, молотка," +
                " викрутки та цвяхів. Їх скарифікували, били та брашували, а наприкінці Юля пофарбувала їх вручну олією кількох " +
                "відтінків для надання більш складної колірної текстури. За таким же принципом реалізовано стіну в санвузлі другого" +
                " поверху та узголів'я ліжка у спальні.\r\n\r\nУ квартирі є кілька перероблених металевих предметів: шафа для одягу" +
                " та тумба в кабінеті. З металевих елементів за допомогою хімії зняли заводське фарбування, покрили спеціальним складом" +
                " для холодного вороніння сталі та закріпили прозорим воском. У спальні біля ліжка стоїть перероблена настільна лампа" +
                " з Ікея. Стандартний світильник зістарили за допомогою газового пальника та молотка.\r\n\r\nЧастину меблів та декору" +
                " купили на аукціонах та барахолках: крісло у вітальні, табурети, дзеркало, робочий стілець, настільна лампа, лампа" +
                " над столиком у спальні – вінтаж, якому дали друге життя.\r\n\r\nУсі картини в інтер'єрі написані Юлею. В основному" +
                " це мальовничі роботи на полотні із серії під назвою «поверхні».",
                OrderNumber = 1,
            });
            for (int i = 0; i < 10; i++)
            {
                project.Elements.Add(new ProjectElement
                {
                    Type = "image",
                    ProjectImage = new ProjectImage
                    {
                        Image = images[92 + i],
                        Project = project
                    },
                    OrderNumber = 2 + i,
                });
            }

            return project;
        }

        private static Project GetProject15(Agency agency, List<Image> images, int count)
        {
            var project = new Project
            {
                Name = "Квартира в скандинавському стилі для молодої пари",
                MainImage = images[102 + count / 5],
                Agency = agency
            };
            project.Elements.Add(new ProjectElement
            {
                Type = "text",
                Text = "ПЛОЩА:   60м2\r\n\r\nСвітла затишна квартира для молодої пари з меблями у стилі mid-century, різними " +
                "геометричними візерунками, використанням дерев'яних рейок в обробці, грифельно-магнітною стіною та скандинавським декором.",
                OrderNumber = 1,
            });
            for (int i = 0; i < 14; i++)
            {
                project.Elements.Add(new ProjectElement
                {
                    Type = "image",
                    ProjectImage = new ProjectImage
                    {
                        Image = images[102 + i],
                        Project = project
                    },
                    OrderNumber = 2 + i,
                });
            }

            return project;
        }
    }
}
